# StructuralSectionIweldedTopflangethickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionIweldedTopflangethickness Property
ParameterTypeId Class See Also
---
"Top Flange Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionIweldedTopflangethickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionIweldedTopflangethickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionIweldedTopflangethickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace